tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
  FeederBucketSnapshot calibration;
  FeederBucketSnapshot dynamicBuckets;
  const bool hasCalibration =
      loadFeederCalibration(g_at24cStore, calibration) == Esp32At24cRecordStore::Result::Ok;
  const bool hasDynamicBuckets =
      loadFeederBuckets(g_at24cStore, dynamicBuckets) == Esp32At24cRecordStore::Result::Ok;
  if (hasCalibration && hasDynamicBuckets) {
    restoreFeederBucketParts(g_buckets, calibration, dynamicBuckets);
  } else if (hasCalibration) {
    g_buckets.restore(calibration);
  }

  syncFeederConfigFromBaseInfo();
}

const char* deviceStateName(FeederDeviceState state) {
  switch (state) {
    case FeederDeviceState::Idle: return "Idle";
    case FeederDeviceState::Running: return "Running";
    case FeederDeviceState::Degraded: return "Degraded";
    case FeederDeviceState::Fault: return "Fault";
  }
  return "Unknown";
}

const char* channelStateName(FeederChannelState state) {
  switch (state) {
    case FeederChannelState::Disabled: return "Disabled";
    case FeederChannelState::Idle: return "Idle";
    case FeederChannelState::Running: return "Running";
    case FeederChannelState::Completed: return "Completed";
    case FeederChannelState::Fault: return "Fault";
  }
  return "Unknown";
}

const char* runSourceName(FeederRunSource source) {
  switch (source) {
    case FeederRunSource::Manual: return "Manual";
    case FeederRunSource::Schedule: return "Schedule";
  }
  return "Manual";
}

const char* recordTypeName(FeederRecordType type) {
  switch (type) {
    case FeederRecordType::ManualRequested: return "FeederManualRequested";
    case FeederRecordType::ScheduleTriggered: return "FeederScheduleTriggered";
    case FeederRecordType::ScheduleMissed: return "FeederScheduleMissed";
    case FeederRecordType::ChannelStarted: return "FeederChannelStarted";
    case FeederRecordType::ChannelStopped: return "FeederChannelStopped";
    case FeederRecordType::BatchCompleted: return "FeederBatchCompleted";
    case FeederRecordType::FaultCleared: return "FeederFaultCleared";
    case FeederRecordType::TodayCleared: return "FeederTodayCleared";
  }
  return "UnknownEvent";
}

bool recordTypeFromName(const char* name, FeederRecordType& out) {
  if (name == nullptr || name[0] == '\0') {
    return false;
  }
  if (strcmp(name, "FeederManualRequested") == 0 || strcmp(name, "ManualRequested") == 0) {
    out = FeederRecordType::ManualRequested;
    return true;
  }
  if (strcmp(name, "FeederScheduleTriggered") == 0 || strcmp(name, "ScheduleTriggered") == 0) {
    out = FeederRecordType::ScheduleTriggered;
    return true;
  }
  if (strcmp(name, "FeederScheduleMissed") == 0 || strcmp(name, "ScheduleMissed") == 0) {
    out = FeederRecordType::ScheduleMissed;
    return true;
  }
  if (strcmp(name, "FeederChannelStarted") == 0 || strcmp(name, "ChannelStarted") == 0) {
    out = FeederRecordType::ChannelStarted;
    return true;
  }
  if (strcmp(name, "FeederChannelStopped") == 0 || strcmp(name, "ChannelStopped") == 0) {
    out = FeederRecordType::ChannelStopped;
    return true;
  }
  if (strcmp(name, "FeederBatchCompleted") == 0 || strcmp(name, "BatchCompleted") == 0) {
    out = FeederRecordType::BatchCompleted;
    return true;
  }
  if (strcmp(name, "FeederFaultCleared") == 0 || strcmp(name, "FaultCleared") == 0) {
    out = FeederRecordType::FaultCleared;
    return true;
  }
  if (strcmp(name, "FeederTodayCleared") == 0 || strcmp(name, "TodayCleared") == 0) {
    out = FeederRecordType::TodayCleared;
    return true;
  }
  return false;
}

const char* recordResultName(FeederRecordResult result) {
  switch (result) {
    case FeederRecordResult::Ok: return "Ok";
    case FeederRecordResult::Partial: return "Partial";
    case FeederRecordResult::Busy: return "Busy";
    case FeederRecordResult::Fault: return "Fault";
    case FeederRecordResult::Skipped: return "Skipped";
    case FeederRecordResult::InvalidArgument: return "InvalidArgument";
  }
  return "InvalidArgument";
}

const char* targetModeFormValue(FeederTargetMode mode) {
  switch (mode) {
    case FeederTargetMode::Grams: return "grams";
    case FeederTargetMode::Revolutions: return "revolutions";
    case FeederTargetMode::None: return "none";
  }
  return "none";
}

void sendUint8(uint8_t value) {
  char number[8];
  snprintf(number, sizeof(number), "%u", static_cast<unsigned>(value));
  Esp32BaseWeb::sendChunk(number);
}

void sendInt32(int32_t value) {
  char number[16];
  snprintf(number, sizeof(number), "%ld", static_cast<long>(value));
  Esp32BaseWeb::sendChunk(number);
}

void sendFixedX100(int32_t value) {
  char number[24];
  const char* sign = value < 0 ? "-" : "";
  const int64_t absValue = value < 0 ? -static_cast<int64_t>(value) : static_cast<int64_t>(value);
  snprintf(number, sizeof(number), "%s%lld.%02lld",
           sign,
           static_cast<long long>(absValue / 100),
           static_cast<long long>(absValue % 100));
  Esp32BaseWeb::sendChunk(number);
}

void sendUint32(uint32_t value) {
  char number[16];
  snprintf(number, sizeof(number), "%lu", static_cast<unsigned long>(value));
  Esp32BaseWeb::sendChunk(number);
}

FeederRecordTime currentRecordTime() {
  FeederRecordTime time;
#if ESP32BASE_ENABLE_NTP
  const Esp32BaseNtp::TimeSnapshot snapshot = Esp32BaseNtp::snapshot();
  time.unixTime = snapshot.synced ? snapshot.epochSec : 0;
  time.uptimeSec = snapshot.uptimeSec;
  time.bootId = snapshot.bootId;
#endif
  return time;
}

#if ESP32BASE_ENABLE_FS
bool appendFeederRecordBytes(const char* path, const uint8_t* data, std::size_t length, void*) {
  return Esp32BaseFs::appendBytes(path, data, length);
}

bool feederRecordPathExists(const char* path, void*) {
  return Esp32BaseFs::exists(path);
}

int64_t feederRecordFileSize(const char* path, void*) {
  return Esp32BaseFs::fileSize(path);
}

bool removeFeederRecordFile(const char* path, void*) {
  return Esp32BaseFs::removeFile(path);
}

bool renameFeederRecordFile(const char* from, const char* to, void*) {
  return Esp32BaseFs::rename(from, to);
}

bool readFeederRecordBytesAt(const char* path,
                             uint32_t offset,
                             uint8_t* out,
                             std::size_t maxLength,
                             std::size_t* readLength,
                             void*) {
  return Esp32BaseFs::readBytesAt(path, offset, out, maxLength, readLength);
}

bool ensureRecordStorageReady() {
  if (g_recordStorageReady) {
    return true;
  }
  if (!Esp32BaseFs::isReady()) {
    return false;
  }
  if (!Esp32BaseFs::exists(kFeederRecordRootDir) && !Esp32BaseFs::mkdir(kFeederRecordRootDir)) {
    return false;
  }
  if (!Esp32BaseFs::exists(kFeederRecordDir) && !Esp32BaseFs::mkdir(kFeederRecordDir)) {
    return false;
  }
  g_recordStorageReady = true;
  return true;
}
#endif

