tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
void sendPlanTargetInputs(const FeederPlanConfig& config, uint8_t channelIndex) {
  const FeederChannelTarget& target = config.targets[channelIndex];
  const unsigned channelNumber = static_cast<unsigned>(channelIndex + 1);
  Esp32BaseWeb::sendChunk("<fieldset><legend>通道");
  sendUint8(static_cast<uint8_t>(channelNumber));
  Esp32BaseWeb::sendChunk("</legend><label>目标模式 <select name='ch");
  sendUint8(channelIndex);
  Esp32BaseWeb::sendChunk("Mode'>");
  const FeederTargetMode modes[] = {
      FeederTargetMode::None,
      FeederTargetMode::Grams,
      FeederTargetMode::Revolutions,
  };
  const char* labels[] = {"不参与", "按克数", "按圈数"};
  for (uint8_t i = 0; i < 3; ++i) {
    Esp32BaseWeb::sendChunk("<option value='");
    Esp32BaseWeb::sendChunk(targetModeFormValue(modes[i]));
    Esp32BaseWeb::sendChunk("'");
    if (target.mode == modes[i]) {
      Esp32BaseWeb::sendChunk(" selected");
    }
    Esp32BaseWeb::sendChunk(">");
    Esp32BaseWeb::sendChunk(labels[i]);
    Esp32BaseWeb::sendChunk("</option>");
  }
  Esp32BaseWeb::sendChunk("</select></label><label>克数 x100 <input name='ch");
  sendUint8(channelIndex);
  Esp32BaseWeb::sendChunk("GramsX100' value='");
  sendInt32(target.targetGramsX100);
  Esp32BaseWeb::sendChunk("'></label><label>圈数 x100 <input name='ch");
  sendUint8(channelIndex);
  Esp32BaseWeb::sendChunk("RevolutionsX100' value='");
  sendInt32(target.targetRevolutionsX100);
  Esp32BaseWeb::sendChunk("'></label></fieldset>");
}

void sendOccurrenceStatus(const FeederPlanState& plan,
                          uint32_t serviceDate,
                          uint32_t currentServiceDate) {
  if (!plan.config.enabled || !plan.config.timeConfigured) {
    Esp32BaseWeb::sendChunk("未启用");
    return;
  }
  if (plan.skipServiceDate == serviceDate) {
    Esp32BaseWeb::sendChunk("已跳过本次");
    return;
  }
  if (serviceDate == currentServiceDate) {
    if (plan.todayExecuted) {
      Esp32BaseWeb::sendChunk("已完成");
    } else if (plan.scheduleAttemptedToday) {
      Esp32BaseWeb::sendChunk("已尝试");
    } else if (plan.scheduleMissedToday) {
      Esp32BaseWeb::sendChunk("已错过");
    } else {
      Esp32BaseWeb::sendChunk("待执行");
    }
    return;
  }
  Esp32BaseWeb::sendChunk("将执行");
}

void sendOccurrenceAction(const FeederPlanState& plan, uint32_t serviceDate) {
  if (!plan.config.enabled || !plan.config.timeConfigured || serviceDate == 0) {
    Esp32BaseWeb::sendChunk("-");
    return;
  }
  const bool skipped = plan.skipServiceDate == serviceDate;
  Esp32BaseWeb::sendChunk("<form method='post' action='");
  Esp32BaseWeb::sendChunk(skipped ? "/api/app/schedule-occurrence/cancel-skip"
                                  : "/api/app/schedule-occurrence/skip");
  Esp32BaseWeb::sendChunk("'><input type='hidden' name='planId' value='");
  sendUint8(plan.config.planId);
  Esp32BaseWeb::sendChunk("'><input type='hidden' name='date' value='");
  sendUint32(serviceDate);
  Esp32BaseWeb::sendChunk("'><button>");
  Esp32BaseWeb::sendChunk(skipped ? "取消跳过" : "跳过本次");
  Esp32BaseWeb::sendChunk("</button></form>");
}

void sendOccurrenceTable(const FeederScheduleSnapshot& schedules,
                         const FeederBucketSnapshot& buckets,
                         uint32_t serviceDate,
                         const char* title) {
  Esp32BaseWeb::sendChunk("<section><h2>");
  Esp32BaseWeb::sendChunk(title);
  Esp32BaseWeb::sendChunk("</h2>");
  if (serviceDate == 0) {
    Esp32BaseWeb::sendChunk("<p>时间未同步，暂不能展示具体执行日期。</p></section>");
    return;
  }
  Esp32BaseWeb::sendChunk("<p>服务日期 ");
  sendUint32(serviceDate);
  Esp32BaseWeb::sendChunk("</p><table><tr><th>时间</th><th>计划</th><th>状态</th><th>目标</th><th>操作</th></tr>");
  for (uint8_t i = 0; i < schedules.planCount; ++i) {
    const FeederPlanState& plan = schedules.plans[i];
    Esp32BaseWeb::sendChunk("<tr><td>");
    sendPlanTime(plan.config.timeMinutes);
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::writeHtmlEscaped(plan.config.name);
    Esp32BaseWeb::sendChunk("</td><td>");
    sendOccurrenceStatus(plan, serviceDate, schedules.serviceDate);
    Esp32BaseWeb::sendChunk("</td><td>");
    sendPlanTargetSummary(plan.config, buckets);
    Esp32BaseWeb::sendChunk("</td><td>");
    sendOccurrenceAction(plan, serviceDate);
    Esp32BaseWeb::sendChunk("</td></tr>");
  }
  Esp32BaseWeb::sendChunk("</table></section>");
}

void sendBucketSummary(const FeederBucketSnapshot& snapshot) {
  Esp32BaseWeb::sendChunk("[");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    const FeederBucketState& channel = snapshot.channels[i];
    Esp32BaseWeb::sendChunk("{\"channel\":");
    sendUint8(i);
    Esp32BaseWeb::sendChunk(",\"name\":\"");
    Esp32BaseWeb::writeJsonEscaped(channel.baseInfo.name);
    Esp32BaseWeb::sendChunk("\",\"enabled\":");
    Esp32BaseWeb::sendChunk(channel.baseInfo.enabled ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"outputPulsesPerRev\":");
    char number[16];
    snprintf(number, sizeof(number), "%ld", static_cast<long>(channel.baseInfo.outputPulsesPerRev));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"gramsPerRevX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(channel.baseInfo.gramsPerRevX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"capacityGramsX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(channel.baseInfo.capacityGramsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"remainGramsX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(channel.remainGramsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"remainPercent\":");
    sendUint8(channel.remainPercent);
    Esp32BaseWeb::sendChunk(",\"underflow\":");
    Esp32BaseWeb::sendChunk(channel.underflow ? "true" : "false");
    Esp32BaseWeb::sendChunk("}");
  }
  Esp32BaseWeb::sendChunk("]");
}

void sendBucketAggregate(const FeederBucketSnapshot& snapshot) {
  uint8_t underflowMask = 0;
  uint8_t enabledMask = 0;
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    const FeederBucketState& channel = snapshot.channels[i];
    if (channel.baseInfo.enabled) {
      enabledMask |= static_cast<uint8_t>(1U << i);
    }
    if (channel.underflow) {
      underflowMask |= static_cast<uint8_t>(1U << i);
    }
  }
  Esp32BaseWeb::sendChunk("{\"channelCount\":");
  sendUint8(kFeederConfiguredChannels);
  Esp32BaseWeb::sendChunk(",\"enabledMask\":");
  sendUint8(enabledMask);
  Esp32BaseWeb::sendChunk(",\"underflowMask\":");
  sendUint8(underflowMask);
  Esp32BaseWeb::sendChunk("}");
}

void sendTodaySummary(const FeederTodaySnapshot& snapshot) {
  Esp32BaseWeb::sendChunk("{\"serviceDate\":");
  sendUint32(snapshot.serviceDate);
  Esp32BaseWeb::sendChunk(",\"channels\":[");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    const FeederTodayChannel& channel = snapshot.channels[i];
    Esp32BaseWeb::sendChunk("{\"channel\":");
    sendUint8(i);
    Esp32BaseWeb::sendChunk(",\"pulses\":");
    char number[16];
    snprintf(number, sizeof(number), "%ld", static_cast<long>(channel.pulses));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"gramsX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(channel.gramsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk("}");
  }
  Esp32BaseWeb::sendChunk("]}");
}

void sendBaseInfoSummary(const FeederBucketSnapshot& snapshot) {
  Esp32BaseWeb::sendChunk("[");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    const FeederChannelBaseInfo& info = snapshot.channels[i].baseInfo;
    Esp32BaseWeb::sendChunk("{\"channel\":");
    sendUint8(i);
    Esp32BaseWeb::sendChunk(",\"name\":\"");
    Esp32BaseWeb::writeJsonEscaped(info.name);
    Esp32BaseWeb::sendChunk("\",\"enabled\":");
    Esp32BaseWeb::sendChunk(info.enabled ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"outputPulsesPerRev\":");
    char number[16];
    snprintf(number, sizeof(number), "%ld", static_cast<long>(info.outputPulsesPerRev));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"gramsPerRevX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(info.gramsPerRevX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"capacityGramsX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(info.capacityGramsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk("}");
  }
  Esp32BaseWeb::sendChunk("]");
}

const char* targetModeName(FeederTargetMode mode) {
  switch (mode) {
    case FeederTargetMode::None: return "None";
    case FeederTargetMode::Grams: return "Grams";
    case FeederTargetMode::Revolutions: return "Revolutions";
  }
  return "None";
}

const char* targetResultName(FeederTargetResult result) {
  switch (result) {
    case FeederTargetResult::Ok: return "Ok";
    case FeederTargetResult::InvalidArgument: return "InvalidArgument";
    case FeederTargetResult::NotCalibrated: return "NotCalibrated";
  }
  return "InvalidArgument";
}

void sendTargetSummary(const FeederTargetSnapshot& targets, const FeederBucketSnapshot& buckets) {
  Esp32BaseWeb::sendChunk("[");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    const FeederTargetRequest& target = targets.channels[i];
    const FeederChannelBaseInfo& info = buckets.channels[i].baseInfo;
    const FeederResolvedTarget resolved = resolveFeederTarget(info, target);
    Esp32BaseWeb::sendChunk("{\"channel\":");
    sendUint8(i);
    Esp32BaseWeb::sendChunk(",\"enabled\":");
    Esp32BaseWeb::sendChunk(info.enabled ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"targetMode\":\"");
    Esp32BaseWeb::sendChunk(targetModeName(target.mode));
    Esp32BaseWeb::sendChunk("\",\"targetGramsX100\":");
    char number[16];
    snprintf(number, sizeof(number), "%ld", static_cast<long>(target.targetGramsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"targetRevolutionsX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(target.targetRevolutionsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"targetPulses\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(resolved.targetPulses));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"estimatedGramsX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(resolved.estimatedGramsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"calibrated\":");
    Esp32BaseWeb::sendChunk(info.gramsPerRevX100 > 0 ? "true" : "false");
    Esp32BaseWeb::sendChunk("}");
  }
  Esp32BaseWeb::sendChunk("]");
}

