tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
bool readTargetModeParam(const char* name, FeederTargetMode& out) {
  char raw[16];
  if (!Esp32BaseWeb::getParam(name, raw, sizeof(raw))) {
    out = FeederTargetMode::None;
    return true;
  }
  return parseTargetModeText(raw, out);
}

const char* bucketResultName(FeederBucketResult result) {
  switch (result) {
    case FeederBucketResult::Ok: return "Ok";
    case FeederBucketResult::InvalidArgument: return "InvalidArgument";
    case FeederBucketResult::Underflow: return "Underflow";
  }
  return "InvalidArgument";
}

void sendResultJson(int code, const char* result, uint32_t commandId = 0) {
  beginRawJson(code);
  Esp32BaseWeb::sendChunk("{\"result\":\"");
  Esp32BaseWeb::sendChunk(result);
  Esp32BaseWeb::sendChunk("\",\"commandId\":");
  sendUint32(commandId);
  Esp32BaseWeb::sendChunk("}");
  endRawJson();
}

void sendConfirmRequired(const char* action, const char* resource) {
  char token[9] = {};
  if (!g_confirm.issue(action, resource, millis(), esp_random(), token, sizeof(token))) {
    sendResultJson(500, "InvalidArgument");
    return;
  }
  beginRawJson(409);
  Esp32BaseWeb::sendChunk("{\"result\":\"ConfirmRequired\",\"actionId\":\"");
  Esp32BaseWeb::sendChunk(action);
  Esp32BaseWeb::sendChunk("\",\"resource\":\"");
  Esp32BaseWeb::sendChunk(resource);
  Esp32BaseWeb::sendChunk("\",\"confirmToken\":\"");
  Esp32BaseWeb::sendChunk(token);
  Esp32BaseWeb::sendChunk("\",\"ttlMs\":60000}");
  endRawJson();
}

bool confirmAccepted() {
  bool confirm = false;
  return readBoolParam("confirm", confirm) && confirm;
}

bool requireConfirm(const char* action, const char* resource) {
  char token[16] = {};
  if (confirmAccepted() &&
      Esp32BaseWeb::getParam("confirmToken", token, sizeof(token)) &&
      g_confirm.consume(action, resource, token, millis())) {
    return true;
  }
  sendConfirmRequired(action, resource);
  return false;
}

void settleStoppedRuns(uint8_t channelMask) {
  bool changed = false;
  const FeederRunSnapshot runs = g_runs.snapshot();
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    const uint8_t bit = static_cast<uint8_t>(1U << i);
    if ((channelMask & bit) == 0 || !runs.channels[i].active) {
      continue;
    }
    FeederRunChannel completed;
    if (!g_runs.finish(i, runs.channels[i].actualPulses, completed)) {
      continue;
    }
    FeederFeedSettlement settlement;
    const FeederFeedSettlementResult result =
        settleCompletedFeederRun(i, completed, g_today, g_buckets, settlement);
    if (result == FeederFeedSettlementResult::Ok ||
        result == FeederFeedSettlementResult::Underflow) {
      changed = true;
    }
  }
  if (changed) {
    persistFeederTodayIfReady();
    persistFeederBucketsIfReady();
  }
}

const char* scheduleResultName(FeederScheduleResult result) {
  switch (result) {
    case FeederScheduleResult::Ok: return "Ok";
    case FeederScheduleResult::Full: return "Full";
    case FeederScheduleResult::NotFound: return "NotFound";
    case FeederScheduleResult::InvalidArgument: return "InvalidArgument";
  }
  return "InvalidArgument";
}

const char* feederCommandResultName(FeederCommandResult result) {
  switch (result) {
    case FeederCommandResult::Ok: return "Ok";
    case FeederCommandResult::Partial: return "Partial";
    case FeederCommandResult::Busy: return "Busy";
    case FeederCommandResult::NotConfigured: return "NotConfigured";
    case FeederCommandResult::Fault: return "Fault";
    case FeederCommandResult::InvalidArgument: return "InvalidArgument";
  }
  return "InvalidArgument";
}

void sendStartResultJson(const FeederStartResult& result,
                         const FeederTargetBatch* targets = nullptr,
                         uint32_t commandId = 0) {
  const bool success = result.result == FeederCommandResult::Ok ||
                       result.result == FeederCommandResult::Partial;
  beginRawJson(success ? 200 : 400);
  Esp32BaseWeb::sendChunk("{\"result\":\"");
  Esp32BaseWeb::sendChunk(feederCommandResultName(result.result));
  Esp32BaseWeb::sendChunk("\",\"commandId\":");
  sendUint32(commandId);
  Esp32BaseWeb::sendChunk(",\"successMask\":");
  sendUint8(result.successMask);
  Esp32BaseWeb::sendChunk(",\"busyMask\":");
  sendUint8(result.busyMask);
  Esp32BaseWeb::sendChunk(",\"faultMask\":");
  sendUint8(result.faultMask);
  Esp32BaseWeb::sendChunk(",\"skippedMask\":");
  sendUint8(result.skippedMask);
  if (targets) {
    Esp32BaseWeb::sendChunk(",\"targetOkMask\":");
    sendUint8(targets->okMask);
    Esp32BaseWeb::sendChunk(",\"targetInvalidMask\":");
    sendUint8(targets->invalidMask);
    Esp32BaseWeb::sendChunk(",\"targetNotCalibratedMask\":");
    sendUint8(targets->notCalibratedMask);
    Esp32BaseWeb::sendChunk(",\"targets\":");
    sendResolvedTargetArray(*targets);
  }
  Esp32BaseWeb::sendChunk(",\"motorOutput\":{\"enabled\":false}}");
  endRawJson();
}

FeederStartResult startResolvedTargets(uint8_t channelMask,
                                       FeederRunSource source,
                                       uint32_t commandId,
                                       FeederTargetBatch& targets,
                                       const FeederTargetSnapshot* targetOverrides = nullptr) {
  const FeederTargetSnapshot storedTargets = g_targets.snapshot();
  targets = resolveFeederTargetsForMask(g_buckets.snapshot(),
                                        targetOverrides ? *targetOverrides : storedTargets,
                                        channelMask);
  if (targets.okMask == 0) {
    FeederStartResult result;
    result.result = FeederCommandResult::InvalidArgument;
    result.skippedMask = channelMask;
    return result;
  }
  FeederStartResult result = g_feeder.startChannels(targets.okMask, source);
  if (result.successMask != 0) {
    g_runs.start(result.successMask, source, targets);
    for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
      const uint8_t bit = static_cast<uint8_t>(1U << i);
      if ((result.successMask & bit) == 0) {
        continue;
      }
      FeederRecord record;
      record.commandId = commandId;
      record.type = FeederRecordType::ChannelStarted;
      record.result = FeederRecordResult::Ok;
      record.channel = i;
      record.successMask = bit;
      record.targetPulses = targets.channels[i].targetPulses;
      record.estimatedGramsX100 = targets.channels[i].estimatedGramsX100;
      recordBusinessEvent(record);
    }
  }
  result.skippedMask |= static_cast<uint8_t>(targets.invalidMask | targets.notCalibratedMask);
  if (result.successMask != 0 && result.skippedMask != 0 && result.result == FeederCommandResult::Ok) {
    result.result = FeederCommandResult::Partial;
  }
  return result;
}

bool readManualTargetOverrides(uint8_t channelMask, FeederTargetSnapshot& out) {
  out = g_targets.snapshot();
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    const uint8_t bit = static_cast<uint8_t>(1U << i);
    if ((channelMask & bit) == 0) {
      continue;
    }
    char name[32];
    char rawMode[20];
    snprintf(name, sizeof(name), "ch%uMode", static_cast<unsigned>(i + 1));
    if (!Esp32BaseWeb::getParam(name, rawMode, sizeof(rawMode)) || rawMode[0] == '\0') {
      continue;
    }
    FeederTargetMode mode = FeederTargetMode::None;
    if (!parseTargetModeText(rawMode, mode) || mode == FeederTargetMode::None) {
      return false;
    }

