tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
  g_schedules.beginDay(0);
  g_today.beginDay(0);

  FeederChannelBaseInfo channelInfo;
  channelInfo.enabled = true;
  channelInfo.outputPulsesPerRev = 4320;
  channelInfo.gramsPerRevX100 = 7000;
  channelInfo.capacityGramsX100 = 500000;
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    snprintf(channelInfo.name, sizeof(channelInfo.name), "通道 %u", static_cast<unsigned>(i + 1));
    if (g_buckets.updateBaseInfo(i, channelInfo) != FeederBucketResult::Ok) {
      ESP32BASE_LOG_E("farmfeeder", "bucket_base_info_failed channel=%u", static_cast<unsigned>(i));
    }
    FeederTargetRequest target;
    target.mode = FeederTargetMode::Grams;
    target.targetGramsX100 = 7000;
    if (g_targets.setTarget(i, target) != FeederTargetResult::Ok) {
      ESP32BASE_LOG_E("farmfeeder", "target_default_failed channel=%u", static_cast<unsigned>(i));
    }
  }
  syncFeederConfigFromBaseInfo();
}

void FarmFeederApp::configureAppConfigPage() {
#if ESP32BASE_ENABLE_APP_CONFIG
  Esp32BaseAppConfig::setTitle("Esp32FarmFeeder 参数");
#endif
}

void FarmFeederApp::configureBusinessShell() {
#if ESP32BASE_ENABLE_WEB
  Esp32BaseWeb::setDeviceName("Esp32FarmFeeder");
  Esp32BaseWeb::setHomePath("/app");
  Esp32BaseWeb::setHomeMode(Esp32BaseWeb::HOME_APP);
  Esp32BaseWeb::setSystemNavMode(Esp32BaseWeb::SYSTEM_NAV_BOTTOM);
  Esp32BaseWeb::addNavItem("/app", "首页");
  Esp32BaseWeb::addNavItem("/schedule", "计划");
  Esp32BaseWeb::addNavItem("/records", "记录");
  Esp32BaseWeb::addNavItem("/base-info", "基础信息");
  Esp32BaseWeb::addNavItem("/diagnostics", "诊断");
  Esp32BaseWeb::addPage("/app", "喂食器首页", FarmFeederApp::sendHomePage);
  Esp32BaseWeb::addPage("/schedule", "喂食计划", FarmFeederApp::sendSchedulePage);
  Esp32BaseWeb::addPage("/schedule/edit", "编辑计划", FarmFeederApp::sendScheduleEditPage);
  Esp32BaseWeb::addPage("/records", "喂食记录", FarmFeederApp::sendRecordsPage);
  Esp32BaseWeb::addPage("/base-info", "基础信息", FarmFeederApp::sendBaseInfoPage);
  Esp32BaseWeb::addPage("/diagnostics", "喂食器诊断", FarmFeederApp::sendDiagnosticsPage);
  addFarmFeederApi("/api/app/status", FarmFeederApp::sendStatusJson);
  addFarmFeederApi("/api/app/diagnostics", FarmFeederApp::sendDiagnosticsJson);
  addFarmFeederApi("/api/app/events/recent", FarmFeederApp::sendRecentEventsJson);
  addFarmFeederApi("/api/app/feeders/manual-start", FarmFeederApp::handleFeederManualStart);
  addFarmFeederApi("/api/app/feeders/start", FarmFeederApp::handleFeederStart);
  addFarmFeederApi("/api/app/feeders/stop", FarmFeederApp::handleFeederStop);
  addFarmFeederApi("/api/app/feeders/stop-all", FarmFeederApp::handleFeederStopAll);
  addFarmFeederApi("/api/app/feeders/targets", FarmFeederApp::sendTargetsJson);
  addFarmFeederApi("/api/app/feeders/target", FarmFeederApp::handleFeederTarget);
  addFarmFeederApi("/api/app/schedules", FarmFeederApp::sendSchedulesJson);
  addFarmFeederApi("/api/app/schedules/create", FarmFeederApp::handleScheduleCreate);
  addFarmFeederApi("/api/app/schedules/update", FarmFeederApp::handleScheduleUpdate);
  addFarmFeederApi("/api/app/schedules/delete", FarmFeederApp::handleScheduleDelete);
  addFarmFeederApi("/api/app/schedule-occurrence/skip", FarmFeederApp::handleScheduleSkip);
  addFarmFeederApi("/api/app/schedule-occurrence/cancel-skip", FarmFeederApp::handleScheduleCancelSkip);
  addFarmFeederApi("/api/app/buckets", FarmFeederApp::sendBucketsJson);
  addFarmFeederApi("/api/app/buckets/set-remaining", FarmFeederApp::handleBucketSetRemaining);
  addFarmFeederApi("/api/app/buckets/add-feed", FarmFeederApp::handleBucketAddFeed);
  addFarmFeederApi("/api/app/buckets/mark-full", FarmFeederApp::handleBucketMarkFull);
  addFarmFeederApi("/api/app/base-info", FarmFeederApp::sendBaseInfoJson);
  addFarmFeederApi("/api/app/base-info/channel", FarmFeederApp::handleBaseInfoChannel);
  addFarmFeederApi("/api/app/records", FarmFeederApp::sendRecordsJson);
  addFarmFeederApi("/api/app/maintenance/clear-today", FarmFeederApp::handleMaintenanceClearToday);
  addFarmFeederApi("/api/app/maintenance/clear-fault", FarmFeederApp::handleMaintenanceClearFault);
#endif
}

void FarmFeederApp::sendHomePage() {
#if ESP32BASE_ENABLE_WEB
  const FeederSnapshot snapshot = g_feeder.snapshot();
  const FeederBucketSnapshot buckets = g_buckets.snapshot();
  Esp32BaseWeb::sendHeader("喂食器首页");
  Esp32BaseWeb::sendChunk("<h1>喂食器首页</h1><section><h2>喂食状态</h2><table>");
  Esp32BaseWeb::sendChunk("<tr><th>设备状态</th><td>");
  Esp32BaseWeb::sendChunk(deviceStateName(snapshot.state));
  Esp32BaseWeb::sendChunk("</td></tr><tr><th>运行通道</th><td>");
  sendUint8(snapshot.runningChannelMask);
  Esp32BaseWeb::sendChunk("</td></tr></table></section><section><h2>手工喂食</h2>");
  Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/feeders/manual-start'>");
  Esp32BaseWeb::sendChunk("<label>通道掩码 <input name='channelMask' value='7'></label> ");
  Esp32BaseWeb::sendChunk("<p>可选本次目标覆盖，不填写则使用已保存的默认目标。</p>");
  Esp32BaseWeb::sendChunk("<label>通道1模式 <input name='ch1Mode' placeholder='Grams/Revolutions'></label> ");
  Esp32BaseWeb::sendChunk("<label>通道1克数x100 <input name='ch1GramsX100'></label> ");
  Esp32BaseWeb::sendChunk("<label>通道1圈数x100 <input name='ch1RevolutionsX100'></label> ");
  Esp32BaseWeb::sendChunk("<label>通道2模式 <input name='ch2Mode' placeholder='Grams/Revolutions'></label> ");
  Esp32BaseWeb::sendChunk("<label>通道2克数x100 <input name='ch2GramsX100'></label> ");
  Esp32BaseWeb::sendChunk("<label>通道2圈数x100 <input name='ch2RevolutionsX100'></label> ");
  Esp32BaseWeb::sendChunk("<label>通道3模式 <input name='ch3Mode' placeholder='Grams/Revolutions'></label> ");
  Esp32BaseWeb::sendChunk("<label>通道3克数x100 <input name='ch3GramsX100'></label> ");
  Esp32BaseWeb::sendChunk("<label>通道3圈数x100 <input name='ch3RevolutionsX100'></label> ");
  Esp32BaseWeb::sendChunk("<button>开始手工喂食</button></form>");
  Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/feeders/stop-all'><button>停止全部</button></form>");
  Esp32BaseWeb::sendChunk("</section><section><h2>料桶余量</h2><table><tr><th>通道</th><th>当前估算</th><th>满桶容量</th></tr>");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    Esp32BaseWeb::sendChunk("<tr><td>");
    sendUint8(static_cast<uint8_t>(i + 1));
    Esp32BaseWeb::sendChunk("</td><td>");
    sendFixedX100(buckets.channels[i].remainGramsX100);
    Esp32BaseWeb::sendChunk(" g</td><td>");
    sendFixedX100(buckets.channels[i].baseInfo.capacityGramsX100);
    Esp32BaseWeb::sendChunk(" g</td></tr>");
  }
  Esp32BaseWeb::sendChunk("</table></section>");
  Esp32BaseWeb::sendFooter();
#endif
}

